Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh11-v3.tmx
Source language: bo
Languages: en

source: དེ་ལ་རྗེས་སུ་རྟོགས་པའི་ཤེས་པ་གང་ཞེ་ན། མིག་མི་རྟག་གོ་ཞེས་ཤེས་པ་གང་ཡིན་པ་དང་། དེ་བཞིན་དུ་རྣ་བ་དང་། སྣ་དང་། ལྕེ་དང་། ལུས་དང་། ཡིད་དང་། གཟུགས་དང་། སྒྲ་དང་། དྲི་དང་། རོ་དང་། རེག་བྱ་དང་། ཆོས་རྣམས་མི་རྟག་གོ་ཞེས་ཤེས་པ་གང་ཡིན་པ་སྟེ།
en: “If you ask what is ‘subsequent knowledge,’ it is the understanding that the eye is impermanent, and, likewise, it is the understanding that the ears, nose, tongue, body, mental faculty, sights, sounds, odors, tastes, tangibles, and mental phenomena are all impermanent.

source: དེ་ནི་རྗེས་སུ་རྟོགས་པ་ཤེས་པ་ཞེས་བྱའོ། །
en: This is called subsequent knowledge.

source: དེ་ལ་ཕ་རོལ་གྱི་སེམས་ཤེས་པ་གང་ཞེ་ན། སེམས་ཉིད་ཀྱིས་སེམས་ཅན་གཞན་རྣམས་དང་། གང་ཟག་གཞན་རྣམས་ཀྱི་སེམས་དང་། སེམས་ལས་བྱུང་བའི་ཆོས་རྣམས་ལ་ཐེ་ཙོམ་མེད་པར་ཤེས་པ་སྟེ།
en: “If you ask what is the ‘knowledge of other minds,’ it is the absence of doubt with regard to phenomena associated with the minds and mental states of other sentient beings and other individuals.

source: དེ་ནི་ཕ་རོལ་གྱི་སེམས་ཤེས་པ་ཞེས་བྱའོ། །
en: This is called knowledge of other minds.

source: དེ་ལ་ཀུན་རྫོབ་ཤེས་པ་གང་ཞེ་ན། ལམ་ཤེས་པ་གང་ཡིན་པ་སྟེ།
en: “If you ask what is the ‘knowledge of relative appearances,’ it is the understanding of the aspects of the path.

source: དེ་ནི་ཀུན་རྫོབ་ཤེས་པ་ཞེས་བྱའོ། །
en: This is called the knowledge of relative appearances.

source: དེ་ལ་སྡུག་བསྔལ་ཤེས་པ་གང་ཞེ་ན། སྡུག་བསྔལ་སྐྱེ་བ་དང་གནས་པ་ཤེས་པ་སྟེ།
en: “If you ask what is the ‘knowledge of suffering,’ it is the understanding of how suffering arises and endures.

source: དེ་ནི་སྡུག་བསྔལ་ཤེས་པ་ཞེས་བྱའོ། །
en: That is called the knowledge of suffering.

source: དེ་ལ་ཀུན་འབྱུང་བ་ཤེས་པ་གང་ཞེ་ན། ཀུན་འབྱུང་བ་སྤོང་བ་ཤེས་པ་གང་ཡིན་པ་སྟེ།
en: “If you ask what is the ‘knowledge of the origin of suffering,’ it is the understanding that the origin of suffering is to be abandoned.

source: དེ་ནི་ཀུན་འབྱུང་བ་ཤེས་པ་ཞེས་བྱའོ། །
en: This is called knowledge of the origin of suffering.

source: དེ་ལ་འགོག་པ་ཤེས་པ་གང་ཞེ་ན།
en: “If you ask what is the ‘knowledge of the cessation of suffering,’ it is the understanding that suffering has ceased.

source: སྡུག་བསྔལ་འགོག་པ་ཤེས་པ་གང་ཡིན་པ་སྟེ། དེ་ནི་འགོག་པ་ཤེས་པ་ཞེས་བྱའོ། །
en: This is called knowledge of the cessation of suffering.

source: དེ་ལ་ལམ་ཤེས་པ་གང་ཞེ་ན། འཕགས་པའི་ལམ་ཡན་ལག་བརྒྱད་པ་ཤེས་པ་གང་ཡིན་པ་སྟེ།
en: “If you ask what is the ‘knowledge of the path,’ it is the understanding of the noble eightfold path.

source: དེ་ནི་ལམ་ཤེས་པ་ཞེས་བྱའོ། །
en: This is called knowledge of the path leading to the cessation of suffering.

source: དེ་ལ་ཟད་པ་ཤེས་པ་གང་ཞེ་ན། འདོད་ཆགས་དང་། ཞེ་སྡང་དང་། གཏི་མུག་རྣམས་ཟད་པར་ཤེས་པ་གང་ཡིན་པ་སྟེ།
en: “If you ask what is the ‘knowledge of the extinction of contaminants,’ it is the understanding that desire, hatred, and delusion have ended.

source: དེ་ནི་ཟད་པར་ཤེས་པ་ཞེས་བྱའོ། །
en: This is called the extinction of contaminants.

source: དེ་ལ་མི་སྐྱེ་བ་ཤེས་པ་གང་ཞེ་ན། སྲིད་པའི་འགྲོ་བ་རྣམས་སུ་མི་སྐྱེ་བ་ཤེས་པ་སྟེ།
en: “If you ask what is the ‘knowledge that contaminants will not be regenerated,’ it is the understanding that one will not subsequently be reborn among the living beings of phenomenal existence.

source: དེ་ནི་མི་སྐྱེ་བ་ཤེས་པ་ཞེས་བྱའོ། །
en: This is called the knowledge that contaminants will not be regenerated.

source: དེ་ལ་ཇི་ལྟ་བ་བཞིན་ཤེས་པ་གང་ཞེ་ན། དེ་བཞིན་གཤེགས་པའི་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱི་ཡེ་ཤེས་གང་ཡིན་པ་སྟེ།
en: “If you ask what is the ‘knowledge that is definitive,’ it is the tathāgatas’ gnosis of omniscience.

source: དེ་ནི་ཇི་ལྟ་བ་བཞིན་ཤེས་པ་ཞེས་བྱའོ། །
en: This is called the knowledge that is definitive.

source: དེ་ལ་མི་ཤེས་པ་ཀུན་ཤེས་པར་བྱེད་པའི་དབང་པོ་གང་ཞེ་ན། གང་ཟག་སློབ་པ་མངོན་པར་རྟོགས་པར་མ་གྱུར་པ་རྣམས་ཀྱི་དད་པའི་དབང་པོ་དང་བརྩོན་འགྲུས་ཀྱི་དབང་པོ་དང་། དྲན་པའི་དབང་པོ་དང་། ཏིང་ངེ་འཛིན་གྱི་དབང་པོ་དང་།
en: “If you ask what are the ‘faculties that will enable knowledge of all that is unknown,’ they comprise the faculty of faith, the faculty of perseverance, the faculty of recollection, the faculty of meditative stability, and the faculty of wisdom, which individual trainees who have not attained actual realization acquire.

source: ཤེས་རབ་ཀྱི་དབང་པོ་གང་ཡིན་པ་སྟེ། དེ་ནི་མི་ཤེས་པ་ཀུན་ཤེས་པར་བྱེད་པའི་དབང་པོ་ཞེས་བྱའོ། །
en: These are called the faculties that will enable knowledge of all that is unknown.

source: དེ་ལ་ཀུན་ཤེས་པའི་དབང་པོ་གང་ཞེ་ན། གང་ཟག་སློབ་པ་མངོན་པར་རྟོགས་པར་གྱུར་པ་རྣམས་ཀྱི་དད་པའི་དབང་པོ་དང་། བརྩོན་འགྲུས་ཀྱི་དབང་པོ་དང་། དྲན་པའི་དབང་པོ་དང་། ཏིང་ངེ་འཛིན་གྱི་དབང་པོ་དང་།
en: “If you ask what are the ‘faculties that acquire the knowledge of all things,’ they comprise the faculty of faith, the faculty of perseverance, the faculty of recollection, the faculty of meditative stability, and the faculty of wisdom, of which individual trainees who have attained actual realization partake.

source: ཤེས་རབ་ཀྱི་དབང་པོ་གང་ཡིན་པ་སྟེ། དེ་ནི་ཀུན་ཤེས་པའི་དབང་པོ་ཞེས་བྱའོ། །དེ་ལ་ཀུན་ཤེས་པ་དང་ལྡན་པའི་དབང་པོ་གང་ཞེ་ན། གང་ཟག་མི་སློབ་པ་འདི་ལྟ་སྟེ། དགྲ་བཅོམ་པ་རྣམས་དང་། རང་སངས་རྒྱས་རྣམས་དང་། བྱང་ཆུབ་སེམས་དཔའ་ས་བཅུ་ལ་གནས་པ་རྣམས་དང་།
en: These are called the faculties that acquire the knowledge of all things.

source: དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་རྣམས་ཀྱི་དད་པའི་དབང་པོ་དང་། བརྩོན་འགྲུས་ཀྱི་དབང་པོ་དང་། དྲན་པའི་དབང་པོ་དང་། ཏིང་ངེ་འཛིན་གྱི་དབང་པོ་དང་། ཤེས་རབ་ཀྱི་དབང་པོ་སྟེ།
en: “If you ask what are the ‘faculties endowed with the knowledge of all things,’ they comprise the faculty of faith, the faculty of perseverance, the faculty of recollection, the faculty of meditative stability, and the faculty of wisdom, of which tathāgatas, arhats, genuinely perfect buddhas partake.

source: དེ་ནི་ཀུན་ཤེས་པ་དང་ལྡན་པའི་དབང་པོ་ཞེས་བྱའོ། །
en: These are called the faculties endowed with the knowledge of all things.

source: དེ་ལ་རྟོག་པ་དང་བཅས་དཔྱོད་པ་དང་བཅས་པའི་ཏིང་ངེ་འཛིན་གང་ཞེ་ན། འདོད་པ་དག་ལས་དབེན་པ། སྡིག་པ་མི་དགེ་བའི་ཆོས་རྣམས་ལས་དབེན་པ། དགའ་བ་དང་བདེ་བ་ཅན་བསམ་གཏན་དང་པོ་བསྒྲུབས་ཏེ་གནས་པ་སྟེ།
en: “If you ask what is the ‘meditative stability endowed with ideation and scrutiny,’ it denotes the first meditative concentration which is achieved and maintained when there is freedom from desires, and freedom from negative and non-virtuous attributes, while joy and bliss are present.

source: དེ་ནི་རྟོག་པ་དང་བཅས་དཔྱོད་པ་དང་བཅས་པའི་ཏིང་ངེ་འཛིན་ཞེས་བྱའོ། །
en: This is called the meditative stability endowed with ideation and scrutiny.

source: དེ་ལ་རྟོག་པ་མེད་ལ་དཔྱོད་པ་ཙམ་གྱི་ཏིང་ངེ་འཛིན་གང་ཞེ་ན།
en: “If you ask what is the ‘meditative stability free from ideation and merely endowed with scrutiny,’ it denotes the interval between the first and second meditative concentrations.

source: བསམ་གཏན་དང་པོ་དང་བསམ་གཏན་གཉིས་པའི་བར་གང་ཡིན་པ་སྟེ་དེ་ནི་རྟོག་པ་མེད་ལ་དཔྱོད་པ་ཙམ་གྱི་ཏིང་ངེ་འཛིན་ཅེས་བྱའོ། །
en: This is called the meditative stability free from ideation and merely endowed with scrutiny.

source: དེ་ལ་མི་རྟོག་མི་དཔྱོད་པའི་ཏིང་ངེ་འཛིན་གང་ཞེ་ན། བསམ་གཏན་དང་པོ་ནས་བཟུང་སྟེ། འདུ་ཤེས་མེད་འདུ་ཤེས་མེད་མིན་གྱི་སྐྱེ་མཆེད་ཀྱི་བར་དུ་སྙོམས་པར་འཇུག་པ་སྟེ།
en: “If you ask what is the ‘meditative stability free from both ideation and scrutiny,’ it denotes the meditative absorptions, starting from the first meditative concentration and continuing as far as the sense field of neither perception nor non-perception.

source: དེ་ནི་མི་རྟོག་མི་དཔྱོད་པའི་ཏིང་ངེ་འཛིན་ཅེས་བྱའོ། །
en: This is called the meditative stability free from both ideation and scrutiny.

source: དེ་ལ་ཟིལ་གྱིས་གནོན་པའི་སྐྱེ་མཆེད་བརྒྱད་གང་ཞེ་ན། འདི་ལྟ་སྟེ། ནང་གཟུགས་སུ་འདུ་ཤེས་པས་ཕྱི་རོལ་གྱི་གཟུགས་ཆུང་ངུ་ཁ་དོག་བཟང་པོ་དང་། ཁ་དོག་ངན་པ་རྣམས་ལ་ལྟ་ཞིང་གཟུགས་དེ་དག་ཟིལ་གྱིས་མནན་ནས་ཤེས་ཟིལ་གྱིས་མནན་ནས་མཐོང་སྟེ། དེ་ལྟ་བུར་འདུ་ཤེས་པར་འགྱུར་བ་འདི་ནི་ཟིལ་གྱིས་གནོན་པའི་སྐྱེ་མཆེད་དང་པོའོ། །
en: “If you ask what are the ‘eight sense fields of mastery,’ they are as follows: (1) The first sense field of mastery refers to the [miraculous] perceptual transformation that ensues when one who perceives inner forms regards lesser external forms, along with excellent colors and inferior colors, understands these forms, having attained mastery over them, and sees them, having attained mastery over them.

source: ནང་གཟུགས་མེད་པར་འདུ་ཤེས་པས་ཕྱི་རོལ་གྱི་གཟུགས་ཆེན་པོར་གྱུར་པ་ཁ་དོག་བཟང་པོ་དང་། ཁ་དོག་ངན་པ་རྣམས་ལ་ལྟ་ཞིང་གཟུགས་དེ་དག་ཟིལ་གྱིས་མནན་ནས་ཤེས་ཟིལ་གྱིས་མནན་ནས་མཐོང་སྟེ། དེ་ལྟ་བུར་འདུ་ཤེས་པར་གྱུར་པ་འདི་ནི་ཟིལ་གྱིས་གནོན་པའི་སྐྱེ་མཆེད་གཉིས་པའོ། །ནང་གཟུགས་མེད་པར་འདུ་ཤེས་པས་ཕྱི་རོལ་གྱི་གཟུགས་སྔོན་པོ་ཁ་དོག་སྔོན་པོ་སྔོན་པོ་ལྟ་བུར་སྟོན་པ། འོད་སྔོན་པོ་འབྱུང་བ་རྣམས་ལ་འདི་ལྟ་སྟེ།
en: (2) The second sense field of mastery refers to the [miraculous] perceptual transformation that ensues when one who perceives inner formlessness regards greater external forms, along with excellent colors and inferior colors, understands these forms, having attained mastery over them, and sees them, having attained mastery over them.

source: དཔེར་ན་ཟར་མའི་མེ་ཏོག་གམ། ཡུལ་བཱ་ར་ནཱ་སིའི་རས་ཕུན་སུམ་ཚོགས་པ་སྔོན་པོ་ཁ་དོག་སྔོན་པོ་སྔོན་པོ་ལྟ་བུར་སྟོན་པ། འོད་སྔོན་པོ་འབྱུང་བ་དེ་བཞིན་དུ་ནང་གཟུགས་མེད་པར་འདུ་ཤེས་པས་ཕྱི་རོལ་གྱི་གཟུགས་སྔོན་པོ་ཁ་དོག་སྔོན་པོ་སྔོན་པོ་ལྟ་བུར་སྟོན་པ། འོད་སྔོན་པོ་འབྱུང་བ་རྣམས་ལ་ལྟ་བ་འདི་ནི་ཟིལ་གྱིས་གནོན་པའི་སྐྱེ་མཆེད་གསུམ་པའོ། །
en: (3) The third sense field of mastery [refers to the miraculous perceptual transformation that] ensues when one who perceives inner formlessness regards blue external forms, blue colors, blue appearances, and blue reflections, such as the blue [form], the blue color, the blue appearance, and the blue reflection of the flax blossom or excellent blue cloth from Vārāṇasī.

source: ནང་གཟུགས་མེད་པར་འདུ་ཤེས་པས་ཕྱི་རོལ་གྱི་གཟུགས་སེར་པོ་ཁ་དོག་སེར་པོ་སེར་པོ་ལྟ་བུར་སྟོན་པ། འོད་སེར་པོ་འབྱུང་བ་རྣམས་ལ་འདི་ལྟ་སྟེ། དཔེར་ན་དོང་ཀའི་མེ་ཏོག་གམ།
en: In the same way, one who perceives inner formlessness regards blue external forms, blue colors, blue appearances, and blue reflections, [and understands these forms, having attained mastery over them, and sees them, having attained mastery over them].

source: ཡུལ་བཱ་ར་ནཱ་སིའི་རས་ཕུན་སུམ་ཚོགས་པ་སེར་པོ། ཁ་དོག་སེར་པོ་སེར་པོ་ལྟ་བུར་སྟོན་པ། འོད་སེར་པོ་འབྱུང་བ་དེ་བཞིན་དུ་ནང་གཟུགས་མེད་པར་འདུ་ཤེས་པས། ཕྱི་རོལ་གྱི་གཟུགས་སེར་པོ་ཁ་དོག་སེར་པོ་སེར་པོ་ལྟ་བུར་སྟོན་པ། འོད་སེར་པོ་འབྱུང་བ་རྣམས་ལ་ལྟ་བ་འདི་ནི་ཟིལ་གྱིས་གནོན་པའི་སྐྱེ་མཆེད་བཞི་པའོ། །
en: (4) The fourth sense field of mastery [refers to the miraculous perceptual transformation that] ensues when one who perceives inner formlessness regards yellow external forms, yellow colors, yellow appearances, and yellow reflections, such as the yellow [form], yellow color, yellow appearance, and yellow reflection of the cassia flower or excellent yellow cloth from Vārāṇasī.

source: ནང་གཟུགས་མེད་པར་འདུ་ཤེས་པས། ཕྱི་རོལ་གྱི་གཟུགས་དམར་པོ་ཁ་དོག་དམར་པོ། དམར་པོ་ལྟ་བུར་སྟོན་པ།
en: In the same way, one who perceives inner formlessness regards yellow external forms, yellow colors, yellow appearances, and yellow reflections, [and understands these forms, having attained mastery over them, and sees them, having attained mastery over them].

source: འོད་དམར་པོ་འབྱུང་བ་རྣམས་ལ་འདི་ལྟ་སྟེ། དཔེར་ན་བན་དུ་ཛི་བའི་མེ་ཏོག་གམ། ཡུལ་བཱ་ར་ནཱ་སིའི་རས་ཕུན་སུམ་ཚོགས་པ་དམར་པོ་ཁ་དོག་དམར་པོ།
en: (5) The fifth sense field of mastery [refers to the miraculous perceptual transformation that] ensues when one who perceives inner formlessness regards red external forms, red colors, red appearances, and red reflections, such as the red [form], red color, red appearance, and red reflection of the pentapetes flower or excellent red cloth from Vārāṇasī.

source: དམར་པོ་ལྟ་བུར་སྟོན་པ། འོད་དམར་པོ་འབྱུང་བ་དེ་བཞིན་དུ་ནང་གཟུགས་མེད་པར་འདུ་ཤེས་པས། ཕྱི་རོལ་གྱི་གཟུགས་དམར་པོ་ཁ་དོག་དམར་པོ། དམར་པོ་ལྟ་བུར་སྟོན་པ། འོད་དམར་པོ་འབྱུང་བ་རྣམས་ལ་ལྟ་བ་འདི་ནི་ཟིལ་གྱིས་གནོན་པའི་སྐྱེ་མཆེད་ལྔ་པའོ། །
en: In the same way, one who perceives inner formlessness regards red external forms, red colors, red appearances, and red reflections, [and understands these forms, having attained mastery over them, and sees them, having attained mastery over them].

source: ནང་གཟུགས་མེད་པར་འདུ་ཤེས་པས། ཕྱི་རོལ་གྱི་གཟུགས་དཀར་པོ་ཁ་དོག་དཀར་པོ། དཀར་པོ་ལྟ་བུར་སྟོན་པ། འོད་དཀར་པོ་འབྱུང་བ་རྣམས་ལ་འདི་ལྟ་སྟེ། དཔེར་ན་སྐར་མ་པ་བ་སངས་ཀྱི་མདོག་དཀར་པོ་ཁ་དོག་དཀར་པོ།
en: (6) The sixth sense field of mastery [refers to the miraculous perceptual transformation that] ensues when one who perceives inner formlessness regards white external forms, white colors, white appearances, and white reflections, such as the white [form], white color, white appearance, and white reflection of the [morning] star Venus [or excellent white cloth from Vārāṇasī].

source: དཀར་པོ་ལྟ་བུར་སྟོན་པ། འོད་དཀར་པོ་འབྱུང་བ་དེ་བཞིན་དུ་ནང་གཟུགས་མེད་པར་འདུ་ཤེས་པས། ཕྱི་རོལ་གྱི་གཟུགས་དཀར་པོ་ཁ་དོག་དཀར་པོ། དཀར་པོ་ལྟ་བུར་སྟོན་པ། འོད་དཀར་པོ་འབྱུང་བ་རྣམས་ལ་ལྟ་བ་འདི་ནི་ཟིལ་གྱིས་གནོན་པའི་སྐྱེ་མཆེད་དྲུག་པའོ། །
en: In the same way, one who perceives inner formlessness regards white external forms, white colors, white appearances, and white reflections, [and understands these forms, having attained mastery over them, and sees them, having attained mastery over them].

source: དེ་རྣམ་པ་ཐམས་ཅད་དུ་གཟུགས་ཀྱི་འདུ་ཤེས་རྣམས་ལས་ཡང་དག་པར་འདས་ཏེ་ཐོགས་པའི་འདུ་ཤེས་རྣམས་ནུབ་པར་གྱུར་ཅིང་། སྣ་ཚོགས་ཀྱི་འདུ་ཤེས་རྣམས་ཡིད་ལ་མི་བྱེད་པས། ནམ་མཁའ་མཐའ་ཡས་སོ་སྙམ་ནས་ནམ་མཁའ་མཐའ་ཡས་སྐྱེ་མཆེད་བསྒྲུབས་ཏེ་གནས་པ་འདི་ནི་ཟིལ་གྱིས་གནོན་པའི་སྐྱེ་མཆེད་བདུན་པའོ། །དེ་རྣམ་པ་ཐམས་ཅད་དུ་ནམ་མཁའ་མཐའ་ཡས་སྐྱེ་མཆེད་ལས་ཡང་དག་པར་འདས་ཏེ།
en: (7) The seventh sense field of mastery ensues when the perceptions of physical forms have been completely transcended in all respects, when the perceptions of obstructed, material phenomena have subsided, and the mind does not engage with diverse perceptions, so that one achieves and abides in the sense field of infinite space, thinking, ‘Space is infinite.’

source: རྣམ་པར་ཤེས་པ་མཐའ་ཡས་སོ་སྙམ་ནས། རྣམ་ཤེས་མཐའ་ཡས་སྐྱེ་མཆེད་བསྒྲུབས་ཏེ་གནས་པ་འདི་ནི་ཟིལ་གྱིས་གནོན་པའི་སྐྱེ་མཆེད་བརྒྱད་པ་སྟེ།
en: (8) The eighth sense field of mastery ensues when the sense field of infinite space has been completely transcended in all respects, and when one achieves and abides in the sense field of infinite consciousness, thinking, ‘Consciousness is infinite.’

source: དེ་དག་ནི་ཟིལ་གྱིས་གནོན་པའི་སྐྱེ་མཆེད་བརྒྱད་ཅེས་བྱའོ། །དེ་ལ་ཟད་པར་གྱི་སྐྱེ་མཆེད་བཅུ་གང་ཞེ་ན། འདི་ལྟ་སྟེ། ཟད་པར་ས་དང་།
en: These are called the eight sense fields of mastery.

source: ཟད་པར་ཆུ་དང་། ཟད་པར་མེ་དང་། ཟད་པར་རླུང་དང་། ཟད་པར་ནམ་མཁའ་དང་། ཟད་པར་སྔོན་པོ་དང་། ཟད་པར་སེར་པོ་དང་།
en: “If you ask what are the ‘ten sense fields of total consummation,’ they comprise (1) the total consummation of the earth element, (2) the total consummation of the water element, (3) the total consummation of the fire element, (4) the total consummation of the wind element, (5) the total consummation of the space element, (6) the total consummation of blueness, (7) the total consummation of yellowness, (8) the total consummation of redness, (9) the total consummation of whiteness, and (10) the total consummation of consciousness.

source: ཟད་པར་དམར་པོ་དང་། ཟད་པར་དཀར་པོ་དང་། ཟད་པར་རྣམ་པར་ཤེས་པ་སྟེ། དེ་དག་ནི་ཟད་པར་གྱི་སྐྱེ་མཆེད་བཅུ་ཞེས་བྱ་སྟེ། ཁམས་ཐམས་ཅད་སའི་ཁམས་སུ་མོས་པར་བྱེད་དེ། ཐམས་ཅད་ཀྱང་སའི་ཁམས་ཁོ་ནར་ཁམས་གཅིག་ཏུ་འགྱུར་རོ། །ཁམས་ཐམས་ཅད་ཆུའི་ཁམས་སུ་མོས་པར་བྱེད་དེ།
en: These are called the ten sense fields of total consummation.

source: ཐམས་ཅད་ཀྱང་ཆུའི་ཁམས་ཁོ་ནར་ཁམས་གཅིག་ཏུ་འགྱུར་རོ། །ཁམས་ཐམས་ཅད་མེའི་ཁམས་སུ་མོས་པར་བྱེད་དེ། ཐམས་ཅད་ཀྱང་མེའི་ཁམས་ཁོ་ནར་ཁམས་གཅིག་ཏུ་འགྱུར་རོ། །ཁམས་ཐམས་ཅད་རླུང་གི་ཁམས་སུ་མོས་པར་བྱེད་དེ། ཐམས་ཅད་ཀྱང་རླུང་གི་ཁམས་ཁོ་ནར་ཁམས་གཅིག་ཏུ་འགྱུར་རོ། །ཁམས་ཐམས་ཅད་ནམ་མཁའི་ཁམས་སུ་མོས་པར་བྱེད་དེ། ཐམས་ཅད་ཀྱང་ནམ་མཁའི་ཁམས་ཁོ་ནར་ཁམས་གཅིག་ཏུ་འགྱུར་རོ། །ཁམས་ཐམས་ཅད་སྔོན་པོར་མོས་པར་བྱེད་དེ། དེ་ཐམས་ཅད་ཀྱང་སྔོན་པོ་ཉིད་དུ་འགྱུར་རོ། ཁམས་ཐམས་ཅད་སེར་པོར་མོས་པར་བྱེད་དེ། དེ་ཐམས་ཅད་ཀྱང་སེར་པོ་ཁོ་ནར་འགྱུར་རོ། །ཁམས་ཐམས་ཅད་དམར་པོར་མོས་པར་བྱེད་དེ། དེ་ཐམས་ཅད་ཀྱང་དམར་པོ་ཁོ་ནར་འགྱུར་རོ། །ཁམས་ཐམས་ཅད་དཀར་པོར་མོས་པར་བྱེད་དེ། དེ་ཐམས་ཅད་ཀྱང་དཀར་པོ་ཁོ་ནར་འགྱུར་རོ། །ཁམས་ཐམས་ཅད་རྣམ་པར་ཤེས་པར་མོས་པར་བྱེད་དེ།
en: [Through these successive meditative stabilities] (1) considering all elements to be present in the earth element, all of them are transformed into a single element, which is exclusively the earth element; (2) considering all elements to be present in the water element, all of them are transformed into a single element, which is exclusively the water element; (3) considering all elements to be present in the fire element, all of them are transformed into a single element, which is exclusively the fire element; (4) considering all elements to be present in the wind element, all of them are transformed into a single element, which is exclusively the wind element; (5) considering all elements to be present in the space element, all of them are then transformed into a single element, which is exclusively the space element; (6) considering all elements to be present in blueness, all of them are transformed into blueness; (7) considering all elements to be present in yellowness, all of them are transformed exclusively into yellowness; (8) considering all elements to be present in redness, all of them are transformed exclusively into redness; (9) considering all elements to be present in whiteness, all of them are transformed exclusively into whiteness; and (10) considering all elements to be present in consciousness, all of them are transformed exclusively into consciousness.

source: ཐམས་ཅད་ཀྱང་རྣམ་པར་ཤེས་པ་ཁོ་ནར་ཁམས་གཅིག་ཏུ་འགྱུར་རོ། །ས་དང་། ཆུ་དང་། མེ་དང་། རླུང་དང་། ནམ་མཁའ་དང་། སྔོན་པོ་དང་། སེར་པོ་དང་། དམར་པོ་དང་།
en: In this way, earth, water, fire, wind, space, blueness, yellowness, redness, whiteness, and consciousness are all transformed exclusively into a single element.

source: དཀར་པོ་དང་། རྣམ་པར་ཤེས་པ་ཐམས་ཅད་ཀྱང་གཅིག་ཁོ་ནར་འགྱུར་ཏེ། དེ་ནི་ཟད་པར་གྱི་སྐྱེ་མཆེད་རྣམས་ཞེས་བྱའོ། །
en: These are called the sense fields of total consummation.

source: ཟད་པར་དུ་སྐྱེ་བ་རྒྱས་པར་བྱེད་པས་དེ་ནི་ཟད་པར་གྱི་སྐྱེ་མཆེད་རྣམས་ཞེས་བྱའོ། །རེ་རེ་ཡང་སྐྱེ་མཆེད་ཐམས་ཅད་དུ་འགྱུར་ཏེ་དེའི་ཕྱིར་ཟད་པར་གྱི་སྐྱེ་མཆེད་རྣམས་ཞེས་བྱའོ། །
en: It is because they intensify the production of their respective elements to the point of consummation that they are called sense fields of total consummation, and they are also known as sense fields of total consummation because each element is respectively transformed into all the others.

source: དེ་ལ་སྟོང་པ་ཉིད་བཅྭ་བརྒྱད་གང་ཞེ་ན། འདི་ལྟ་སྟེ། ནང་སྟོང་པ་ཉིད་དང་། ཕྱི་སྟོང་པ་ཉིད་དང་། ཕྱི་ནང་སྟོང་པ་ཉིད་དང་། སྟོང་པ་ཉིད་སྟོང་པ་ཉིད་དང་། ཆེན་པོ་སྟོང་པ་ཉིད་དང་། དོན་དམ་པ་སྟོང་པ་ཉིད་དང་། འདུས་བྱས་སྟོང་པ་ཉིད་དང་། འདུས་མ་བྱས་སྟོང་པ་ཉིད་དང་། མཐའ་ལས་འདས་པ་སྟོང་པ་ཉིད་དང་། ཐོག་མ་དང་ཐ་མ་མེད་པ་སྟོང་པ་ཉིད་དང་། དོར་བ་མེད་པ་སྟོང་པ་ཉིད་དང་། རང་བཞིན་སྟོང་པ་ཉིད་དང་། ཆོས་ཐམས་ཅད་སྟོང་པ་ཉིད་དང་། །རང་གི་མཚན་ཉིད་སྟོང་བ་ཉིད་དང་། །མི་དམིགས་པ་སྟོང་པ་ཉིད་དང་། དངོས་པོ་མེད་པ་སྟོང་པ་ཉིད་དང་། ངོ་བོ་ཉིད་སྟོང་པ་ཉིད་དང་། དངོས་པོ་མེད་པའི་ངོ་བོ་ཉིད་སྟོང་པ་ཉིད་དོ། །
en: “If you ask what are the ‘eighteen aspects of emptiness,’ they comprise (1) emptiness of internal phenomena, (2) emptiness of external phenomena, (3) emptiness of both external and internal phenomena, (4) emptiness of emptiness, (5) emptiness of great extent, (6) emptiness of ultimate reality, (7) emptiness of conditioned phenomena, (8) emptiness of unconditioned phenomena, (9) emptiness of the unlimited, (10) emptiness of that which has neither beginning nor end, (11) emptiness of non-dispersal, (12) emptiness of inherent existence, (13) emptiness of intrinsic defining characteristics, (14) emptiness of all things, (15) emptiness of non-apprehension, (16) emptiness of non-entities, (17) emptiness of essential nature, and (18) emptiness of the essential nature of non-entities.

source: དེ་ལ་ནང་སྟོང་པ་ཉིད་གང་ཞེ་ན། ནང་གི་ཆོས་རྣམས་ཞེས་བྱ་བ་ནི་འདི་ལྟ་སྟེ། མིག་དང་། རྣ་བ་དང་། སྣ་དང་།
en: “If, among them, you ask what is the ‘emptiness of internal phenomena,’ the term ‘internal phenomena’ comprises the eyes, ears, nose, tongue, body, and mental faculty.

source: ལྕེ་དང་། ལུས་དང་། ཡིད་དེ། དེ་ལ་ཐེར་ཟུག་ཏུ་གནས་པ་མེད་པ་དང་། འཇིག་པ་མེད་པའི་ཕྱིར་མིག་ནི་མིག་གིས་སྟོང་ངོ་། །
en: Among them, the eyes are empty of the eyes because they do not endure and they do not disintegrate.

source: དེ་ཅིའི་ཕྱིར་ཞེ་ན། དེའི་རང་བཞིན་དེ་ཡིན་པའི་ཕྱིར་རོ། །དེ་བཞིན་དུ་ཐེར་ཟུག་ཏུ་གནས་པ་མེད་པ་དང་།
en: If you ask why, it is because that is their very nature.

source: འཇིག་པ་མེད་པའི་ཕྱིར་རྣ་བ་དང་། སྣ་དང་། ལྕེ་དང་། ལུས་དང་། ཡིད་ནི་ཡིད་ཀྱིས་སྟོང་ངོ་། །
en: Similarly, the ears, the nose, the tongue, the body, and the mental faculty are, respectively, empty of [the ears, the nose, the tongue, the body, and] the mental faculty, because they do not endure and they do not disintegrate.

source: དེ་ཅིའི་ཕྱིར་ཞེ་ན། དེའི་རང་བཞིན་དེ་ཡིན་པའི་ཕྱིར་ཏེ།
en: If you ask why, it is because that is their very nature.

source: དེ་ནི་ནང་སྟོང་པ་ཉིད་ཅེས་བྱའོ། །
en: That is what is called the emptiness of internal phenomena.

source: དེ་ལ་ཕྱི་སྟོང་པ་ཉིད་གང་ཞེ་ན། ཕྱིའི་ཆོས་རྣམས་ཞེས་བྱ་བ་ནི་འདི་ལྟ་སྟེ། གཟུགས་དང་། སྒྲ་དང་། དྲི་དང་།
en: “If you ask what is the ‘emptiness of external phenomena,’ the term ‘external phenomena’ comprises sights, sounds, odors, tastes, tangibles, and mental phenomena.

source: རོ་དང་། རེག་བྱ་དང་། ཆོས་རྣམས་ཏེ། དེ་ལ་ཐེར་ཟུག་ཏུ་གནས་པ་མེད་པ་དང་། འཇིག་པ་མེད་པའི་ཕྱིར་གཟུགས་རྣམས་ནི་གཟུགས་རྣམས་ཀྱིས་སྟོང་ངོ་། །
en: Among them, sights are empty of sights because they do not endure and they do not disintegrate.

source: འཇིག་པ་མེད་པའི་ཕྱིར་སྒྲ་དང་། དྲི་དང་། རོ་དང་། རེག་བྱ་དང་། ཆོས་རྣམས་ནི་ཆོས་རྣམས་ཀྱིས་སྟོང་ངོ་། །
en: Similarly, sounds, odors, tangibles, and mental phenomena are, respectively, empty of [sounds, odors, tangibles, and] mental phenomena, because they do not endure and they do not disintegrate.

source: དེ་ནི་ཕྱི་སྟོང་པ་ཉིད་ཅེས་བྱའོ། །
en: That is called the emptiness of external phenomena.

source: དེ་ལ་ཕྱི་ནང་སྟོང་པ་ཉིད་གང་ཞེ་ན། ཕྱི་དང་ནང་གི་ཆོས་རྣམས་ཞེས་བྱ་བ་ནི་ནང་གི་སྐྱེ་མཆེད་དྲུག་དང་ཕྱིའི་སྐྱེ་མཆེད་དྲུག་སྟེ།
en: “If you ask what is the ‘emptiness of both external and internal phenomena,’ the term ‘external and internal phenomena’ comprises the six inner sense fields and the six outer sense fields.

source: དེ་ལ་ཐེར་ཟུག་ཏུ་གནས་པ་མེད་པ་དང་། འཇིག་པ་མེད་པའི་ཕྱིར་ནང་གི་ཆོས་རྣམས་ནི་ནང་གི་ཆོས་རྣམས་ཀྱིས་སྟོང་ངོ་། །
en: Among them, internal phenomena are empty of internal phenomena because they do not endure and they do not disintegrate.

source: དེ་ཅིའི་ཕྱིར་ཞེ་ན། དེའི་རང་བཞིན་དེ་ཡིན་པའི་ཕྱིར་རོ། །
en: If you ask why, it is because that is their very nature.

source: ཐེར་ཟུག་ཏུ་གནས་པ་མེད་པ་དང་འཇིག་པ་མེད་པའི་ཕྱིར་ཕྱིའི་ཆོས་རྣམས་ཀྱང་ཕྱིའི་ཆོས་རྣམས་ཀྱིས་སྟོང་ངོ་། །
en: External phenomena are also empty of external phenomena because they do not endure and they do not disintegrate.

source: དེ་ནི་ཕྱི་ནང་སྟོང་པ་ཉིད་ཅེས་བྱའོ། །
en: That is called the emptiness of external and internal phenomena.

source: དེ་ལ་སྟོང་པ་ཉིད་སྟོང་པ་ཉིད་གང་ཞེ་ན། ཐེར་ཟུག་ཏུ་གནས་པ་མེད་པ་དང་། འཇིག་པ་མེད་པའི་ཕྱིར་ཆོས་ཐམས་ཅད་ཀྱི་སྟོང་པ་ཉིད་གང་ཡིན་པའི་སྟོང་པ་ཉིད་དེས་ཀྱང་ཆོས་ཐམས་ཅད་ཀྱི་སྟོང་པ་ཉིད་སྟོང་ངོ་། །
en: “If you ask what is the ‘emptiness of emptiness,’ that emptiness which is the emptiness of all phenomena is also empty of the emptiness of all phenomena because it does not endure and does not disintegrate.

source: དེ་ནི་སྟོང་པ་ཉིད་སྟོང་པ་ཉིད་ཅེས་བྱའོ། །
en: That is called the emptiness of emptiness.

source: དེ་ལ་ཆེན་པོ་སྟོང་པ་ཉིད་གང་ཞེ་ན། ཐེར་ཟུག་ཏུ་གནས་པ་མེད་པ་དང་། འཇིག་པ་མེད་པའི་ཕྱིར་ཤར་ཕྱོགས་ནི་ཤར་ཕྱོགས་ཀྱིས་སྟོང་ངོ་། །
en: “If you ask what is the ‘emptiness of great extent,’ the eastern direction is empty of the eastern direction because it does not endure and does not disintegrate.
